## Staging: alarms
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 5 to add, 1 to change, 2 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.route53_ddos will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "route53_ddos" {
        id                        = "Route53DDoS"
      ~ ok_actions                = [
          + "",
          - "arn:aws:sns:us-east-1:687401027353:alert-ok",
        ]
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_lambda_permission.notify_slack_critical will be created
  + resource "aws_lambda_permission" "notify_slack_critical" {
      + action        = "lambda:InvokeFunction"
      + function_name = "NotifySlackSNS"
      + id            = (known after apply)
      + principal     = "sns.amazonaws.com"
      + source_arn    = "arn:aws:sns:ca-central-1:687401027353:alert-critical"
      + statement_id  = "AllowExecutionFromSNSCriticalAlert"
    }

  # aws_lambda_permission.notify_slack_ok_us_east must be replaced
-/+ resource "aws_lambda_permission" "notify_slack_ok_us_east" {
      ~ id            = "AllowExecutionFromSNSOkAlertUSEast" -> (known after apply)
      - source_arn    = "arn:aws:sns:us-east-1:687401027353:alert-ok" -> null # forces replacement
        # (4 unchanged attributes hidden)
    }

  # aws_sns_topic_policy.cloudwatch_events_critical_sns will be created
  + resource "aws_sns_topic_policy" "cloudwatch_events_critical_sns" {
      + arn    = "arn:aws:sns:ca-central-1:687401027353:alert-critical"
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "SNS:Subscribe",
                          + "SNS:SetTopicAttributes",
                          + "SNS:RemovePermission",
                          + "SNS:Receive",
                          + "SNS:Publish",
                          + "SNS:ListSubscriptionsByTopic",
                          + "SNS:GetTopicAttributes",
                          + "SNS:DeleteTopic",
                          + "SNS:AddPermission",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + AWS:SourceOwner = [
                                  + "687401027353",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                      + Sid       = "SNS_Default_Policy"
                    },
                  + {
                      + Action    = "sns:Publish"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "events.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "SNS_Publish_statement"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_sns_topic_subscription.topic_critical will be created
  + resource "aws_sns_topic_subscription" "topic_critical" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "arn:aws:lambda:ca-central-1:687401027353:function:NotifySlackSNS"
      + endpoint_auto_confirms          = false
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:ca-central-1:687401027353:alert-critical"
    }

  # aws_sns_topic_subscription.topic_ok_us_east must be replaced
-/+ resource "aws_sns_topic_subscription" "topic_ok_us_east" {
      ~ arn                             = "arn:aws:sns:us-east-1:687401027353:alert-ok:a3badcf8-bda9-471b-9e74-d1d5eac9a72a" -> (known after apply)
      ~ confirmation_was_authenticated  = true -> (known after apply)
      ~ id                              = "arn:aws:sns:us-east-1:687401027353:alert-ok:a3badcf8-bda9-471b-9e74-d1d5eac9a72a" -> (known after apply)
      ~ owner_id                        = "687401027353" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
      - topic_arn                       = "arn:aws:sns:us-east-1:687401027353:alert-ok" -> null # forces replacement
        # (5 unchanged attributes hidden)
    }

Plan: 5 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.alb_ddos"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.route53_ddos"]

10 tests, 8 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
